
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hayas1/tfgh/actions/runs/11890301556)



<pre><code>Apply complete! Resources: 5 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["json-with-comments"].github_repository.this: Refreshing state... [id=json-with-comments]
module.repositories["devcontainer-features"].github_repository.this: Refreshing state... [id=devcontainer-features]
module.repositories["relentless"].github_repository.this: Refreshing state... [id=relentless]
module.repositories["tokei-toukei"].github_repository.this: Refreshing state... [id=tokei-toukei]
module.repositories["tokei-toukei"].github_branch_default.this: Refreshing state... [id=tokei-toukei]
module.repositories["json-with-comments"].github_branch_default.this: Refreshing state... [id=json-with-comments]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["relentless"].github_branch_default.this: Refreshing state... [id=relentless]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["devcontainer-features"].github_branch_default.this: Refreshing state... [id=devcontainer-features]
module.repositories["json-with-comments"].github_repository_ruleset.this: Refreshing state... [id=2629668]
module.repositories["relentless"].github_repository_ruleset.this: Refreshing state... [id=2653838]
module.repositories["tokei-toukei"].github_repository_ruleset.this: Refreshing state... [id=2639488]
module.repositories["devcontainer-features"].github_repository_ruleset.this: Refreshing state... [id=2602488]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["tokei-toukei"].github_issue_label.this["breaking"]: Refreshing state... [id=tokei-toukei:breaking]
module.repositories["json-with-comments"].github_issue_label.this["deps"]: Refreshing state... [id=json-with-comments:deps]
module.repositories["tokei-toukei"].github_issue_label.this["refactor"]: Refreshing state... [id=tokei-toukei:refactor]
module.repositories["devcontainer-features"].github_issue_label.this["refactor"]: Refreshing state... [id=devcontainer-features:refactor]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["json-with-comments"].github_issue_label.this["documentation"]: Refreshing state... [id=json-with-comments:documentation]
module.repositories["json-with-comments"].github_issue_label.this["feature"]: Refreshing state... [id=json-with-comments:feature]
module.repositories["relentless"].github_issue_label.this["bugfix"]: Refreshing state... [id=relentless:bugfix]
module.repositories["tokei-toukei"].github_issue_label.this["documentation"]: Refreshing state... [id=tokei-toukei:documentation]
module.repositories["json-with-comments"].github_issue_label.this["breaking"]: Refreshing state... [id=json-with-comments:breaking]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["deps"]: Refreshing state... [id=devcontainer-features:deps]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["devcontainer-features"].github_issue_label.this["maintenance"]: Refreshing state... [id=devcontainer-features:maintenance]
module.repositories["json-with-comments"].github_issue_label.this["maintenance"]: Refreshing state... [id=json-with-comments:maintenance]
module.repositories["relentless"].github_issue_label.this["breaking"]: Refreshing state... [id=relentless:breaking]
module.repositories["relentless"].github_issue_label.this["refactor"]: Refreshing state... [id=relentless:refactor]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["relentless"].github_issue_label.this["maintenance"]: Refreshing state... [id=relentless:maintenance]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["tokei-toukei"].github_issue_label.this["feature"]: Refreshing state... [id=tokei-toukei:feature]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["json-with-comments"].github_issue_label.this["refactor"]: Refreshing state... [id=json-with-comments:refactor]
module.repositories["devcontainer-features"].github_issue_label.this["breaking"]: Refreshing state... [id=devcontainer-features:breaking]
module.repositories["relentless"].github_issue_label.this["deps"]: Refreshing state... [id=relentless:deps]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["tokei-toukei"].github_issue_label.this["maintenance"]: Refreshing state... [id=tokei-toukei:maintenance]
module.repositories["devcontainer-features"].github_issue_label.this["feature"]: Refreshing state... [id=devcontainer-features:feature]
module.repositories["tokei-toukei"].github_issue_label.this["deps"]: Refreshing state... [id=tokei-toukei:deps]
module.repositories["relentless"].github_issue_label.this["documentation"]: Refreshing state... [id=relentless:documentation]
module.repositories["tokei-toukei"].github_issue_label.this["bugfix"]: Refreshing state... [id=tokei-toukei:bugfix]
module.repositories["relentless"].github_issue_label.this["feature"]: Refreshing state... [id=relentless:feature]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["devcontainer-features"].github_issue_label.this["documentation"]: Refreshing state... [id=devcontainer-features:documentation]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["devcontainer-features"].github_issue_label.this["bugfix"]: Refreshing state... [id=devcontainer-features:bugfix]
module.repositories["json-with-comments"].github_issue_label.this["bugfix"]: Refreshing state... [id=json-with-comments:bugfix]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=json-with-comments/.github/release.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tokei-toukei/.github/release.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tokei-toukei/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tfgh/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=devcontainer-features/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=dyson-rs/.github/issue_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=json-with-comments/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=devcontainer-features/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/workflows/labeler.yml]
module.repositories["relentless"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=relentless/.github/release.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tokei-toukei/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=json-with-comments/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:json-with-comments:48]
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tokei-toukei:29]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:devcontainer-features:45]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:dyson-rs:13]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:80]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"9c6370bd27637ac4f8ce4417690f51844bb98ffb10ed5d6c816d25cc523ec266\"" -> "W/\"9a7a65f8cd8b7e57a46590c8f80f06d6cf78e86cc20a7ae4d4db31a2c494c939\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"ad509717d0e6764f5b1b97454141d81f76350fa01462fb90f8a1c4e673054fc9\"" -> "W/\"9f20dca849d24bc8404856e85415af4bc1f6e64f14ac8c2273d2ede4b9787d29\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"93c1e0653540c05cd13b533a8344e7d02df7bf8594921a950f2194246508e762\"" -> "W/\"5771e20347ad85054305bdbf7743c6884a8b700e8c98d142dcfc3c81ef973466\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["relentless"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"ab5400407f0cc23ffdb355f39c9f66793cda6d012c816906ffccd29548a5ba60\"" -> "W/\"59ecb16387c7fc0bfb090a71cd1799077124c86c3a3378c6f49f162e4207e472\""
        id                          = "relentless"
        name                        = "relentless"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"12ebf751e084f8ecb0d5bf1943ae5ea1e1f2a82d79b6ebf49d2cf1906649a7ea\"" -> "W/\"2ab54d3b766d74fdd334f023d2c24874a23547d91d862fae21801731f0c344ef\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"9585e10b07b60b6bd5b0f0f31fd38f077537930025a1e4fe922e8392031e5d5b\"" -> "W/\"975a6b112b25217473e9b4e2e55d0c4f1a5b48e7645b5575d64aec6a7eb2e32d\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repositories["relentless"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/issue_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                            = ".github/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/pull_request_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                            = ".github/workflows/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "relentless"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
module.repositories["relentless"].github_repository_file.this["github/labeler.yml"]: Creating...
module.repositories["relentless"].github_repository_file.this["github/pull_request_template.md"]: Creating...
module.repositories["relentless"].github_repository_file.this["github/issue_template.md"]: Creating...
module.repositories["relentless"].github_repository_file.this["github/workflows/labeler.yml"]: Creating...
module.repositories["relentless"].github_repository_file.this["github/pull_request_template.md"]: Creation complete after 10s [id=relentless/.github/pull_request_template.md]
module.repositories["relentless"].github_repository_file.this["github/workflows/labeler.yml"]: Creation complete after 10s [id=relentless/.github/workflows/labeler.yml]
module.repositories["relentless"].github_repository_file.this["github/labeler.yml"]: Creation complete after 10s [id=relentless/.github/labeler.yml]
module.repositories["relentless"].github_repository_file.this["github/issue_template.md"]: Still creating... [10s elapsed]
module.repositories["relentless"].github_repository_file.this["github/issue_template.md"]: Creation complete after 11s [id=relentless/.github/issue_template.md]
module.repositories["relentless"].github_repository_pull_request.managed: Creating...
module.repositories["relentless"].github_repository_pull_request.managed: Creation complete after 2s [id=hayas1:relentless:28]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":76,"Program":"tfcmt","SHA1":"25fe74502b8f75a7c9552fb8a31fd6e104ebf026","Vars":{},"WorkflowName":"Terraform apply on push"} -->